In [3]:
%load tutorial.db [rw]

In [4]:
Create table If Not Exists Weather (id int, recordDate date, temperature int)

In [5]:
insert into Weather (id, recordDate, temperature) values ('1', '2015-01-01', '10')

In [6]:
insert into Weather (id, recordDate, temperature) values ('2', '2015-01-02', '25')

In [7]:
insert into Weather (id, recordDate, temperature) values ('3', '2015-01-03', '20')

In [8]:
insert into Weather (id, recordDate, temperature) values ('4', '2015-01-04', '30')

In [9]:
select * from weather

+----+------------+-------------+
| id | recordDate | temperature |
+----+------------+-------------+
| 1  | 2015-01-01 | 10          |
+----+------------+-------------+
| 2  | 2015-01-02 | 25          |
+----+------------+-------------+
| 3  | 2015-01-03 | 20          |
+----+------------+-------------+
| 4  | 2015-01-04 | 30          |
+----+------------+-------------+

## Write a solution to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

The result format is in the following example.

In [22]:
select *
from weather W1 left join weather W2
on W1.recordDate = Date(W2.recordDate, '+1 day')

+----+------------+-------------+----+------------+-------------+
| id | recordDate | temperature | id | recordDate | temperature |
+----+------------+-------------+----+------------+-------------+
| 1  | 2015-01-01 | 10          |    |            |             |
+----+------------+-------------+----+------------+-------------+
| 2  | 2015-01-02 | 25          | 1  | 2015-01-01 | 10          |
+----+------------+-------------+----+------------+-------------+
| 3  | 2015-01-03 | 20          | 2  | 2015-01-02 | 25          |
+----+------------+-------------+----+------------+-------------+
| 4  | 2015-01-04 | 30          | 3  | 2015-01-03 | 20          |
+----+------------+-------------+----+------------+-------------+

In [23]:
select *
from weather W1 left join weather W2
on W1.recordDate = Date(W2.recordDate, '+1 day')
where W1.temperature > W2.temperature

+----+------------+-------------+----+------------+-------------+
| id | recordDate | temperature | id | recordDate | temperature |
+----+------------+-------------+----+------------+-------------+
| 2  | 2015-01-02 | 25          | 1  | 2015-01-01 | 10          |
+----+------------+-------------+----+------------+-------------+
| 4  | 2015-01-04 | 30          | 3  | 2015-01-03 | 20          |
+----+------------+-------------+----+------------+-------------+

In [24]:
select W1.id
from weather W1 left join weather W2
on W1.recordDate = Date(W2.recordDate, '+1 day')
where W1.temperature > W2.temperature

+----+
| id |
+----+
| 2  |
+----+
| 4  |
+----+